FV2610/E_1004.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

footer
v4.3 | 23.06.2026 (urspr. 01.04.2026) | ebdamame v1.0.0 | rebdhuhn v1.2.0
endfooter

title
Sperrprozesse Gas

17.3.1: AD: Wiederherstellung der Anschlussnutzung (Entsperren) auf Anweisung des LF



end title
:<b>E_1004</b>;
note right
<b><i>Prüfende Rolle: NB
end note

if (<b>10: </b> Wurde die Sperrung durch den UC "Unterbrechung der Anschlussnutzung (Sperren&#41; auf Anweisung des LF" ausgelöst?) then (ja)
else (nein)
    :A05;
    note left
        Cluster: Ablehnung
        Marktlokation wurde nicht über den UC (Unterbrechung der Anschlussnutzung (Sperren&#41; auf Anweisung des LF&#41; gesperrt. 
        Hinweis: Die Entsperrung muss auf konventionellem Weg erfolgen.
    endnote
    kill;
endif
if (<b>20: </b> Wäre eine Wiederinbetriebnahme aufgrund eines technischen Verhinderungsgrundes (z.B. entspricht nicht den geltenden Rechtsvorschriften, behördlichen Verfügungen, den anerkannten Regeln der Technik, DVGW Technischen Anschlussbedingungen (TAB&#41; oder den sonstigen besonderen Vorschriften des NB&#41; nicht möglich?) then (ja)
    :A06;
    note left
        Cluster: Ablehnung
        Wiederinbetriebnahme wäre technisch nicht möglich
        Hinweis:
        Die Marktlokation bzw. die dazugehörigen elektrischen Anlagen kann gemäß NAV und TAB nicht wieder in Betrieb genommen werden. Sie entspricht nicht der geltenden Rechtsvorschriften und behördlichen Verfügungen sowie den anerkannten Regeln der Technik, DVGW, den Technischen Anschlussbedingungen (TAB&#41; und den sonstigen besonderen Vorschriften des NB.
    endnote
    kill;
else (nein)
endif
if (<b>30: </b> Ist zum Zeitpunkt des Nachrichteneingangs die Marktlokation bereits gesperrt?) then (ja)
else (nein)
    :A01;
    note left
        Cluster: Ablehnung
        Marktlokation ist nicht gesperrt.
    endnote
    kill;
endif
if (<b>40: </b> Liegt bereits ein Entsperrauftrag vor?) then (ja)
    :A04;
    note left
        Cluster: Ablehnung
        Entsperrauftrag für die Marktlokation liegt bereits vor.
    endnote
    kill;
else (nein)
endif
if (<b>50: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
    :A99;
    note left
        Cluster: Ablehnung
        Sonstiges
        Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen. 
        Nutzungsmöglichkeit Ende: 01.04.2027 00:00 Uhr
    endnote
    kill;
else (nein)
    :A03;
    note left
        Cluster: Zustimmung
        Zustimmung
    endnote
    kill;
endif

@enduml
